var E0001 = "E:E0001:รูปแบบวันที่ไม่ถูกต้อง";
var E0002 = "E:E0002:วันที่สิ้นสุดการใช้งานต้องมากกว่าวันที่เริ่มต้น";
var E0003 = "E:E0003:ค้นหาตามเงื่อนไขแล้วไม่พบข้อมูล";
var E0004 = "E:E0004:กรุณาระบุเงื่อนไขอย่างใดอย่างหนึ่ง";
var E0005 = "E:E0005:กรุณาระบุวันที่";
var E0006 = "E:E0006:ข้อมูลบังคับไม่ครบ";
var E0007 = "E:E0007:กรุณาเลือก";
var E0008 = "E:E0008:กรุณาระบุเดือน";
var E0009 = "E:E0009:กรุณาระบุปี";
// ใช้ในกรณีต้องการให้ระบุค่ามากกว่า 
// เช่น showMsg(E0019) + " 0.00" หมายถึง "ค่าที่บันทึกต้องมากกว่า 0.00"
// หรือ showMsgField(E0019, "อัตราภาษีมูลค่าเพิ่ม") + " 0.00" หมายถึง "อัตราภาษีมูลค่าเพิ่ม ค่าที่บันทึกต้องมากกว่า 0.00"
var E0010 = "E:E0010:ค่าที่บันทึกต้องมากกว่า";
// ใช้ในกรณีต้องการให้ระบุค่ามากกว่า
// เช่น showMsg(E0019) + " 0.00" หมายถึง "ค่าที่บันทึกต้องมากกว่า 0.00"
// หรือ showMsgField(E0019, "อัตราภาษีมูลค่าเพิ่ม") + " 0.00" หมายถึง "อัตราภาษีมูลค่าเพิ่ม ค่าที่บันทึกต้องมากกว่า 0.00"
var E0011 = "E:E0011:ต้องไม่มากกว่า";
var E0012 = "E:E0012:ปี พ.ศ. ที่ระบุต้องอยู่ระหว่าง ปี พ.ศ. 2450 - พ.ศ. 2599";
var E0013 = "E:E0013:รูปแบบวันที่ไม่ถูกต้อง เนื่องจาก วันที่ เดือน และปีไม่สอดคล้องกันเช่น\n31042545 ไม่ถูกต้องเนื่องจากเดือน 04 หรือ เมษายน มีเพียง 30 วันเท่านั้น หรือ\n29022545 ไม่ถูกต้องเนื่องจากปีพ.ศ. 2545 เดือนกุมภาพันธ์มี 28 วันเป็นต้น";
var E0014 = "E:E0014:ระบุเดือนไม่ถูกต้อง ให้ระบุเป็น 01 - 12 เท่านั้น";
var E0015 = "E:E0015:รูปแบบวันที่ไม่ถูกต้อง เนื่องจาก\n ความยาวมากกว่า หรือน้อยกว่า 8 ตัวอักษร";
var E0016 = "E:E0016:รูปแบบวันที่ไม่ถูกต้อง เนื่องจาก\n1. ประกอบด้วยตัวอักษรอื่นนอกจากตัวเลข  0-9 \n2. มีเครื่องหมายอื่นๆประกอบอยู่ด้วยเช่น / เป็นต้น";
var E0017 = "E:E0017:วันที่ที่บันทึกต้องน้อยกว่าหรือเท่ากับวันที่ปัจจุบัน";
var E0018 = "E:E0018:ต้องไม่น้อยกว่า";
var E0019 = "E:E0019:วันเดือนปีเกิดไม่ถูกต้อง";
var E0020 = "E:E0020:วันที่ที่บันทึกต้องมากกว่าหรือเท่ากับวันที่ปัจจุบัน";
var E0021 = "E:E0021:วันที่สิ้นสุดต้องมากกว่าหรือเท่ากับวันที่เริ่มต้น"; 


// ของกรม 
var E0022 = "E:E0022:ยกเลิกให้ไปใช้ E0006"; // [X]ต้องแสดงซื่อ  input Name  
var E0023 = "E:E0023:รหัสผู้ใช้ และ/หรือ รหัสผ่าน ไม่ถูกต้อง";
var E0024 = "E:E0024:บันทึกอักขระตามรูปรหัสไม่ถูกต้อง";
var E0025 = "E:E0025:เอกสารแนบไม่ครบตามที่กำหนด";// [X]ต้องแสดงซื่อ  input Name  
var E0026 = "E:E0026:การตรวจสอบข้อมูลพบข้อผิดพลาด";
var E0027 = "E:E0027:รูปแบบข้อมูลไม่ถูกต้องตามที่กำหนด ";// [X]ต้องแสดงซื่อ  input Name  
var E0028 = "E:E0028:ระบบขัดข้องไม่สามารถให้บริการในขณะนี้";
var E0029 = "E:E0029:ขนาดไฟล์ใหญ่กว่าที่กำหนด";
var E0030 = "E:E0030:รูปแบบไฟล์ไม่ถูกต้อง";
var E0031 = "E:E0031:รหัสเพื่อใช้ในการเปิดไฟล์ไม่ถูกต้อง";
var E0032 = "E:E0032:การยืนยันรหัสเพื่อใช้ในการเปิดไฟล์ไม่ถูกต้อง";
var E0033 = "E:E0033:กรุณาเลือกรายการที่ต้องการทำรายการ";// [X]ต้องแสดงซื่อ  input Name  
var E0035 = "E:E0035:ไม่สามารถลงทะเบียนได้ เพราะ";// [X]ต้องแสดงซื่อ  input Name  
var E0036 = "E:E0036:ระบบยังไม่มีการเชื่อมต่ออินเทอร์เน็ต";
var E0037 = "E:E0037:รูปแบบไฟล์ข้อมูลไม่ถูกต้องกับที่กำหนด";
var E0038 = "E:E0038:ไม่สามารถอ่านไฟล์ข้อมูลได้";
var E0039 = "E:E0039:ข้อมูล 'ตำแหน่งเริ่มต้น' และ 'ตำแหน่งสิ้นสุด' ไม่สอดคล้องกัน";
var E0040 = "E:E0040:ชื่อ Tag ข้อมูลซ้ำซ้อนกัน";
var E0041 = "E:E0041:ระบบไม่สามารถติดต่อเครื่องแม่ข่ายระบบงานที่สำนักงานสรรพากรพื้นที่";
var E0042 = "E:E0042:ยังไม่มีการบันทึกแบบ ไม่สามารถบันทึกรายการใบแนบได้";
var E0043 = "E:E0043:กรุณาเลือกข้อมูลก่อนบันทึกข้อมูล";
var E0044 = "E:E0044:กรุณาระบุเงื่อนไขก่อนการค้นหา";
var E0046 = "E:E0046:บันทึกเลขประจำตัวผู้เสียภาษีอากร(13 หลัก) ไม่ถูกต้อง กรุณาบันทึกใหม่";
var E0049 = "E:E0049:ผู้มีหน้าที่หักภาษี ณ ที่จ่ายนี้ไม่ได้รับสิทธิในการยื่นแบบโดยไม่มีใบแนบ";
var E0050 = "E:E0050:กรุณาบันทึกข้อมูลให้ครบ(จำนวนราย,เงินได้ทั้งสิ้น,ภาษีที่นำส่งทั้งสิ้น)";
var E0051 = "E:E0051:กรุณาบันทึกข้อมูล";
var E0052 = "E:E0052:ข้อมูลจากสื่อที่ระบุ รหัสประจำตัวผู้เสียภาษีอากร(13 หลัก) ไม่ตรงกัน";
var E0053 = "E:E0053:ข้อมูลจากสื่อที่ระบุ รหัสประจำตัวผู้เสียภาษีอากร  ไม่ตรงกัน";
var E0054 = "E:E0054:ไม่สามารถปรับปรุงสถานะแบบได้";
var E0055 = "E:E0055:ช่วงระยะเวลาที่สามารถบันทึกได้ต้องไม่เกิน 31 วัน";
var E0056 = "E:E0056:เดือนปีที่บันทึกต้องน้อยกว่าหรือเท่ากับเดือนปีปัจจุบัน";
var E0066 = "E:E0066:หมดเวลาเชื่อมต่อกับระบบ SSO";
var E0067 = "E:E0067:รูปแบบไฟล์ข้อมูลไม่ถูกต้องกับที่กำหนด";
var E0068 = "E:E0068:ไฟล์ข้อมูลมีการยื่นเพิ่มเติมต่อจากไฟล์ที่ต้องการลบ";
var E0069 = "E:E0069:ข้อมูลการลงทะเบียนซ้ำซ้อนกับการลงทะเบียนเดิม";
var E0070 = "E:E0070:อักขระตามรูปไม่ถูกต้อง";
var E0071 = "E:E0071:เกิดข้อผิดพลาด ไม่สามารถลบข้อมูลได้";
var E0072 = "E:E0072:โปรดระบุรายการที่ต้องการลบ";
var E0073 = "E:E0073:ข้อมูลซ้ำไม่สามารถเพิ่มได้ ";
var E0074 = "E:E0074:การยืนยันรหัสไม่ถูกต้อง ";
var E0075 = "E:E0075:ไม่สามารถทำรายการได้ ";
var E0076 = "E:E0076:ไม่พบรหัสผู้ใช้ในระบบงาน ";

// SVS Error Message
var E9001 = "E:E9001:เลขอ้างอิงการลงทะเบียน และ/หรือเลขประจำตัวผู้เสียภาษีอากร(13 หลัก) ไม่ถูกต้อง ";
var E9002 = "E:E9002:ค้นหาตามเงื่อนไขแล้วไม่พบข้อมูล";
var E9003 = "E:E9003:สถานะการส่งไม่สมบูรณ์ที่เกิดจากระบบไม่สามารถดำเนินการส่งได้ในขณะนั้น";
var E9004 = "E:E9004:สถานะการส่งไม่สมบูรณ์ที่เกิดจากพื้นที่เก็บอีเมล์ของผู้เสียภาษีอากรไม่เพียงพอ";
var E9005 = "E:E9005:ไม่สามารถลบข้อมูลได้";
var E9006 = "E:E9006:เกิดข้อผิดพลาดขณะค้นหาข้อมูล";
var E9007 = "E:E9007:เกิดข้อผิดพลาดขณะประมวลผล";
var E9008 = "E:E9008:เกิดข้อผิดพลาดขณะดึงข้อมูลจากฐานข้อมูล";
var E9009 = "E:E9009:กรุณาระบุข้อมูลเพื่อใช้ในการค้นหา";
var E9010 = "E:E9010:เกิดข้อผิดพลาดขณะโหลดข้อมูล";
var E9011 = "E:E9011:เกิดข้อผิดพลาดขณะนำส่งไฟล์ (Upload)";
var E9012 = "E:E9012:ท่านได้ลงทะเบียนไว้แล้ว กรมไม่อนุญาตให้ลงทะเบียนซ้ำ";
var E9013 = "E:E9013:ท่านบันทึกข้อมูลไม่ตรงตามรูปแบบที่กำหนด";
var E9014 = "E:E9014:เดือนปีที่บันทึกต้องน้อยกว่าหรือเท่ากับเดือนปีปัจจุบัน ไม่อนุญาตให้ทำรายการล่วงหน้า";
var E9015 = "E:E9015:โปรดกรอกหมายเลขโทรศัพท์เป็นตัวเลขทั้งหมด ตามตัวอย่าง 029999999";
var E9016 = "E:E9016:ระบบไม่อนุญาตให้เพิ่มผู้มีหน้าหักภาษี ณ ที่จ่ายรายเดิมซ้ำได้";
var E9017 = "E:E9017:กรุณาระบุผู้มีหน้าที่หักภาษี ณ ที่จ่ายก่อนทำรายการ";
var E9018 = "E:E9018:เดือนที่จ่ายเงินได้พึงประเมินต้องน้อยกว่าหรือเท่ากับเดือน ปัจจุบัน";
var E9019 = "E:E9019:เดือนที่จ่ายเงินได้พึงประเมินต้องมากกว่าเดือนปัจจุบัน ไม่เกิน 1 เดือน";
var E9020 = "E:E9020:ไม่สามารถบันทึก 2 ช่องว่างติดกันได้";
var E9021 = "E:E9021:ไม่สามารถออกใบรับรองอิเล็กทรอนิกส์ได้ เนื่องจากระบุข้อมูลใบรับรองอิเล็กทรอนิกส์เดิมไม่ถูกต้อง";
var E9022 = "E:E9022:ไม่สามารถออกใบรับรองอิเล็กทรอนิกส์ได้";
var E9023 = "E:E9023:กรุณายอบรับข้อตกลงการใช้ระบบงานให้บริการภาษีเงินได้ หัก ณ ที่จ่าย แบบออนไลน์  ก่อนการลงทะเบียนบริการอิเล็กทรอนิกส์ภาษีเงินได้หัก ณ ที่จ่าย";

var E9201 = "E:E9201:หน่วยงานในไฟล์ไม่ตรงกับหน่วยงานในฐานข้อมูล";
var E9202 = "E:E9202:ชื่อแผนกซ้ำกับในฐานข้อมูล";
var E9203 = "E:E9203:เดือน/ปีภาษีในไฟล์ไม่ตรงกับเดือน/ปีภาษีที่เลือก";
var E9204 = "E:E9204:จำนวนข้อมูลในไฟล์ไม่ตรงกับข้อมูลควบคุม";

var E9301 = "E:E9301:ปี พ.ศ. ที่ระบุต้องอยู่ระหว่าง ปี พ.ศ. 2500 - พ.ศ. 2599";
var E9302 = "E:E9302:ยังไม่มีการบันทึกแบบ ไม่สามารถพิมพ์แบบฯ ได้";
var E9303 = "E:E9303:ซ้ำกับในฐานข้อมูล";
var E9304 = "E:E9304:กรุณาบันทึกข้อมูลแถวที่";
var E9305 = "E:E9305:วันที่ไม่อยู่ในเดือนปีภาษีที่นำส่ง";
var E9306 = "E:E9306:จำนวนเงินภาษีต้องมากกว่าหรือเท่ากับ";
var E9307 = "E:E9307:เงื่อนไขการหักภาษี ณ ที่จ่ายไม่ถูกต้อง \n1 = หัก ณ ที่จ่าย \n2 = ออกให้ตลอดไป \n3 = ออกให้ครั้งเดียว";
var E9308 = "E:E9308:อัตราภาษีต้องไม่เกิน 100";
var E9309 = "E:E9309:กรุณาบันทึกประเภทเงินได้อย่างน้อย 1 รายการ";
var E9310 = "E:E9310:เกิดข้อผิดพลาด";
var E9311 = "E:E9311:ค่าที่ได้รับไม่ถูกต้อง";
var E9312 = "E:E9312:ท่านเคยนำส่งไฟล์ภาษีของเดิอน/ปีนี้ไว้แล้ว <br> หากต้องการนำส่งไฟล์ใหม่ กรุณากดปุ่ม\"ยืนยัน\"เพื่อยกเลิก <br> หากไม่ต้องการ กรุณากดปุ่ม\"ปิด\"";
var E9313 = "E:E9313:ชื่อไฟล์ซ้ำกัน";
var E9314 = "E:E9314:กรุณานำส่งไฟล์";
var E9315 = "E:E9315:รูปแบบ E-mail ไม่ถูกต้อง";
var E9316 = "E:E9316:ไม่อนุญาตให้ลบประเภทเงินได้แถวสุดท้าย";
var E9317 = "E:E9317:บันทึกประเภทเงินได้ซ้ำกัน";
var E9318 = "E:E9318:ยื่นเพิ่มเติมครั้งที่ต้องมีค่ามากกว่าศูนย์";
var E9319 = "E:E9319:ลำดับที่ต้องมีค่ามากกว่าศูนย์";
var E9320 = "E:E9320:วันที่ต้องอยู่ในช่วงของเดือน/ปีภาษีที่เลือก";
var E9321 = "E:E9321:ไม่พบชื่อไฟล์ภาษี";
var E9322 = "E:E9322:กรุณาบันทึกเป็นตัวเลขเท่านั้น";
var E9323 = "E:E9323:สถานะของ Certifacate ไม่ถูกต้อง";
var E9324 = "E:E9324:Certificate ของท่านหมดอายุแล้ว ไม่สามารถใช้งานได้";
var E9325 = "E:E9325:ไฟล์ที่ใช้เข้ารหัสไม่ถูกต้อง";
var E9326 = "E:E9326:ไม่พบไฟล์ Private Key ของผู้มีหน้าที่หักฯ";
var E9327 = "E:E9327:ไม่พบไฟล์ Public Key ของผู้มีหน้าที่หักฯ";
var E9328 = "E:E9328:ไม่พบไฟล์ Public Key ของกรมสรรพากร";
var E9329 = "E:E9329:ไม่พบรหัส Passphrase";
var E9330 = "E:E9330:ไม่สามารถสร้างไฟล์ได้ กรุณาสร้างไฟล์ใหม่อีกครั้ง";
var E9331 = "E:E9331:จำนวนปีที่ทำงานต้องเริ่มตั้งแต่ 5 ปีขึ้นไป";
var E9332 = "E:E9332:เลขประจำตัวผู้เสียภาษีอากร (13 หลัก) ในไฟล์ไม่ถูกต้อง";
var E9333 = "E:E9333:ปีภาษีในไฟล์ไม่ถูกต้อง";
var E9334 = "E:E9334:บันทึกประเภทเงินได้ต้องไม่เกิน 3 รายการ";
var E9335 = "E:E9335:จำนวนบุตรรวมกันเกิน 3 คน กรุณาตรวจสอบ";
var E9336 = "E:E9336:ไม่พบรหัสพรรคการเมือง";
var E9337 = "E:E9337:เดือนในไฟล์ไม่ถูกต้อง";

var E9401 = "E:E9401:ระบบ TIN ไม่รองรับการทำงาน"; //ใช้ชั่วคราวรอ confirm จากระบบงาน tin ก่อน
var E9402 = "E:E9402:เพิ่มผู้มีหน้าที่หักได้เฉพาะรายที่ได้รับอนุมัติการลงทะเบียนแล้วเท่านั้น";
var E9403 = "E:E9403:ไม่อนุญาติให้แก้ไขข้อมูล";
var E9404 = "E:E9404:ชื่อประเภทเงินได้ซ้ำกับในฐานข้อมูล";

var W9011 = "W:W9011:ข้อมูลเลขประจำตัวผู้เสียภาษีอากร(13 หลัก)\n หากผู้ใช้ไม่กรอกระบบจะบันทึกค่า \n เป็น  0-00-0000-00000-00-0 ";
var W9013 = "W:W9013:ข้อมูลสาขาที่ \n หากผู้ใช้ไม่กรอกระบบจะบันทึกค่า\n เป็น  000000";

var I0001 = "I:I0001:บันทึกข้อมูลเรียบร้อยแล้ว";
var I0002 = "I:I0002:ลบข้อมูลเรียบร้อยแล้ว";
var I0003 = "I:I0003:ไม่สามารถบันทึกข้อมูลได้";
var I0004 = "I:I0004:ไม่พบข้อมูลตามเงื่อนไขที่ระบุ";     
var I0005 = "I:I0005:ไม่สามารถลบข้อมูลได้";
var I0006 = "I:I0006:ท่านไม่มีสิทธิเข้าใช้ระบบงาน";
var I0007 = "I:I0007:เกิดข้อผิดพลาดขณะค้นหาข้อมูล";
var I0008 = "I:I0008:ยกเลิกแบบเรียบร้อยแล้ว";
var I0009 = "I:I0009:ยืนยันการบันทึกข้อมูล";
var I0010 = "I:I0010:ยืนยันการลบข้อมูล";
var I0011 = "I:I0011:กำลังประมวลผลกรุณารอสักครู่";
var I0012 = "I:I0012:ยืนยันการพิมพ์";
var I0013 = "I:I0013:เกิดข้อผิดพลาดขณะประมวลผล";
var I0014 = "I:I0014:เกิดข้อผิดพลาดขณะดึงข้อมูลจากฐานข้อมูล";
var I0015 = "I:I0015:กรุณาระบุข้อมูลเพื่อใช้ในการค้นหา";
var I0016 = "I:I0016:โหลดข้อมูลเรียบร้อยแล้ว";   
var I0017 = "I:I0017:เกิดข้อผิดพลาดขณะโหลดข้อมูล";
var I0018 = "I:I0018:เกิดข้อผิดพลาดขณะ Upload ไฟล์";
var I0019 = "I:I0019:มีการเปลี่ยนแปลงข้อมูลกรุณา บันทึกข้อมูล[ปรับปรุงสถานะแบบ]";
var I0020 = "I:I0020:บันทึกข้อมูลเรียบร้อยแล้ว ยืนยันการสิ้นสุดการบันทึกข้อมูล";
var I0021 = "I:I0021:บันทึกข้อมูลเรียบร้อยแล้ว ยืนยันการตรวจสอบการบันทึกข้อมูล";
var I0022 = "I:I0022:ยืนยันการเลือกรายการใบแนบ";
var I0023 = "I:I0023:ยืนยันการตรวจสอบข้อมูล";
var I0024 = "I:I0024:ยืนยันการสิ้นสุดการบันทึกเอกสารนี้";
var I0025 = "I:I0025:ยืนยันการออกจากโปรแกรม";
var I0026 = "I:I0026:ประมวลผลข้อมูลเรียบร้อยแล้ว";

var I9001 = "I:I9001:บันทึกข้อมูลเรียบร้อยแล้ว";
var I9002 = "I:I9002:ลบข้อมูลเรียบร้อยแล้ว";
var I9003 = "I:I9003:ไม่สามารถบันทึกข้อมูลได้";
var I9004 = "I:I9004:ไม่พบข้อมูลตามเงื่อนไขที่ระบุ";
var I9011 = "I:I9011:กำลังประมวลผลกรุณารอสักครู่";
var I9016 = "I:I9016:โหลดข้อมูลเรียบร้อยแล้ว";   
var I9017 = "I:I9017:ยกเลิกหนังสือรับรองเรียบร้อยแล้ว";
var I9018 = "I:I9018:ยกเลิกการส่งไฟล์ภาษีเรียบร้อยแล้ว";
var I9020 = "I:I9020:ไม่พบข้อมูลตามเงื่อนไขที่ระบุ จึงไม่สามารถสร้างไฟล์ได้"
var I9021 = "I:I9021:แบบภ.ง.ด.1 ไม่สามารถเลือกเดือนที่จ่ายเงินได้พึงประเมินทั้งปีได้"
var I9022 = "I:I9022:แบบภ.ง.ด.2 ไม่สามารถเลือกเดือนที่จ่ายเงินได้พึงประเมินทั้งปีได้"
var I9025 = "I:I9025:ระบบได้รับข้อมูลการลงทะเบียนของท่านเรียบร้อยแล้ว";  
var I9026 = "I:I9026:กรณีของผู้มีเงินได้ที่เคยมีเงินได้มาก่อน เข้ามาทำงานระหว่างปีจะต้องนำเงิน \n" +
            "ได้สะสมยกมา, ภาษีสะสมยกมา, กบข. สะสมยกมา, กสจ.สะสมยกมา  หรือ \n" +
            "ประกันสังคมสะสมยกมา จากหนังสือรับรองการหักภาษี ณ ที่จ่ายของหน่วยงานเดิมที่ \n" +
            "เคยจ่ายเงินได้ในปีภาษีนี้มาบันทึกในหน้าเงินได้และภาษีสะสมยกมา ทั้งนี้ เพื่อ \n" +
            "โปรแกรมจะได้คำนวณภาษีให้พอดี โดยไม่ต้องขอคืนหรือชำระเพิ่ม ";
var I9027 = "I:I9027:ระบบดำเนินการปรับปรุงข้อมูลการลงทะเบียนของท่านเรียบร้อยแล้ว";
var I9028 = "I:I9028:ยกเลิกข้อมูลการลงทะเบียนเรียบร้อยแล้ว";
var I9029 = "I:I9029:โปรดระบุเลขที่สาขา";
var I9030 = "I:I9030:ดำเนินการ RESET PASSWORD เรียบร้อยแล้ว";
var I9031 = "I:I9031:ไม่พบข้อมูลตามเงื่อนไขที่ระบุ จึงไม่สามารถ Backup ได้";
var I9032 = "I:I9032:Backup ข้อมูลเรียบร้อยแล้ว";  

var I9033 = "I:I9033:บันทึกข้อมูลเรียบร้อยแล้ว  กรุณาบันทึกข้อมูลที่อยู่";  
var I9301 = "I:I9301:สร้างไฟล์เรียบร้อยแล้ว";

var C9001 = "C:C9001:ยืนยันการบันทึกข้อมูล";
var C9002 = "C:C9002:ยืนยันการลบข้อมูล";
var C9003 = "C:C9003:ยืนยันการพิมพ์";
var C9004 = "C:C9004:ยืนยันการแก้ไขข้อมูล";
var C9005 = "C:C9005:ยืนยันการแจ้งยกเลิกการลงทะเบียน";
var C9006 = "C:C9006:ยืนยันการเลือกรายการใบแนบ";
var C9007 = "C:C9007:ยืนยันการตรวจสอบข้อมูล";
var C9008 = "C:C9008:ยืนยันการสิ้นสุดการบันทึกเอกสารนี้";
var C9009 = "C:C9009:บันทึกข้อมูลเรียบร้อยแล้ว ยืนยันการสิ้นสุดการบันทึกข้อมูล";
var C9010 = "C:C9010:บันทึกข้อมูลเรียบร้อยแล้ว ยืนยันการตรวจสอบการบันทึกข้อมูล";
var C9011 = "C:C9011:ยืนยันการจบการทำงาน";
var C9012 = "C:C9012:ยืนยันการล้างข้อมูล";
var C9013 = "C:C9013:ยืนยันการอนุมัติข้อมูล";
var C9014 = "C:C9014:ยืนยันการค้นหาข้อมูล";
var C9015 = "C:C9015:เพื่อประโยชน์ในการติดต่อระหว่างกรมสรรพากร และหน่วยงานของท่าน \n" +
		    "โปรดบันทึกข้อมูลเพิ่มเติมเกี่ยวกับผู้ทำหน้าที่ติดต่อประสานงาน";
var C9016 = "C:C9016:โปรดยืนยันการเลือกผู้มีหน้าที่หักภาษี ณ ที่จ่าย";
var C9017 = "C:C9017:ยืนยันการยกเลิกหนังสือรับรอง";
var C9018 = "C:C9018:ยืนยันการยกเลิกการส่งไฟล์ภาษี";
var C9019 = "C:C9019:กรุณาบันทึกผู้ติดต่อประสานงาน \n"+
			"ด้วยเลขที่อ้างอิงการลงทะเบียนของผู้มี\n"+
			"หน้าที่หักภาษี ณ ที่จ่ายรายนี้ก่อน";

var C9020 = "C:C9020:พบข้อมูล ภ.ง.ด. 1 ที่ต้องการแล้ว ต้องการทำรายการต่อหรือไม่";
var C9021 = "C:C9021:แสดงว่าต้องประมวลผลใหม่  ต้องลบรายการเดิมออกก่อน"; 
var C9022 = "C:C9022:โปรแกรมจะทำการลบข้อมูลปี พ.ศ.  ออกจากฐานข้อมูลก่อน ท่านต้องการยืนยันการเรียกคืนฐานข้อมูลหรือไม่";
var C9023 = "C:C9023:ยืนยันการดึงข้อมูลจากระบบ E-GP ของกรมบัญชีกลาง";
///////////////////////////////////////////////// Error_Warning.js ////////////////////////////////
var messageLanguage = 2;
// Insert by Prawith
// กรณีหลาย ๆ Field ที่มี Err เหมือนกัน
// เช่น อัตราชดเชยกรมศุลฯ และ อัตรานำส่งกองทุน
// ค่าที่บันทึกได้ต้องไม่เกิน 100.00
function showMsgField( code, field ) {

     arr = code.split(":");
     typDesc = getTypeDesc(arr[0]); 
     mesg = typDesc + "\n\n" + arr[1] + ": " + field + " " + arr[messageLanguage] + "";
     return mesg;
}
function showMsg( code ){
     arr = code.split(":");
     typDesc = getTypeDesc(arr[0]); 
     mesg = typDesc + arr[1] + ": " + arr[messageLanguage] + "";
     return mesg;
}

function getTypeDesc(codeType) {
	iconClass = "";
	title = "";
	if( codeType == "W" ) {
		iconClass = "ui-icon-alert";
		if( messageLanguage == 2 ) {
		     title = "ข้อความเตือน";
		} else {
			 title = "Warning";
		}
	}	
	if( codeType == "E" ) {
		iconClass = "ui-icon-alert";
		if( messageLanguage == 2 ) {
		     title = "ข้อความปฏิเสธ";
		} else {
			 title = "Error";
		}
	}
	if( codeType == "I" ) {
		iconClass = "ui-icon-info";
		if( messageLanguage == 2 ) {
		     title = "Information";
		} else {
			 title = "Information";
		}
	}
	strType = "<p><span class='ui-icon " + iconClass + "' style='float: left; margin: 0pt 7px 20px 0pt;'></span>" + title + "</p>";
	return strType;
}
/**
* ส่ง parameter :  param = E#E7011:วันที่รับ ตั้งแต่ ต้องไม่มากกว่า วันที่รับ ถึง
* การเรียกใช้ message ที่ jsp คือ alert(showMessage(param));
* เหตุผลการสร้าง การเรียกใช้ Function กลาง อาจทำให้มีการใช้ message code ที่แตกต่างกัน
**/
function showMessage( message ){

     arr = message.split("#");
     typHead = getTypeDesc(arr[0]); 
     typDesc = arr[1];
     mesg = typHead + "\n" + "\n" + arr[1];
     return mesg;
}

//Nattakrit c.
